<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"c13047e864f2017318e6b922ed2d5c064fab6449419060286c6447097bf55a34","plan_job_ref":"Job Terraform PRs for Azure #26 at https://github.com/acm-uic/IaC/actions/runs/5441669381","plan_hash":"54ff4429ad9c551398df46498dcac29c11e022b2ce8a93e192ffc156e284349d","plan_text_format":"text","version":"1.36.0"} -->
Terraform plan in __azure/terraform/stacks/acm-general__ in the __prod__ workspace
With var files: `azure/terraform/stacks/acm-general/configuration/prod.tfvars`
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application.externaldns will be updated in-place
  ~ resource "azuread_application" "externaldns" {
        id                             = "54b75934-f56f-4502-ae8e-e019eef47efb"
      ~ owners                         = [
          - "920bf583-cb9b-4365-a61e-bb33988c5484",
          + "21ec2c63-534d-4cfb-bc43-83773ce40e54",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # azuread_service_principal.externaldns will be updated in-place
  ~ resource "azuread_service_principal" "externaldns" {
        id                           = "515bac91-a7ba-4f57-9673-7c58c162f5d4"
      ~ owners                       = [
          - "920bf583-cb9b-4365-a61e-bb33988c5484",
          + "21ec2c63-534d-4cfb-bc43-83773ce40e54",
        ]
        tags                         = []
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azuread_service_principal_password.externaldns will be created
  + resource "azuread_service_principal_password" "externaldns" {
      + display_name         = "externaldnsPassword"
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = "************************************"
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ externaldns_sp_keyid    = "************************************" -> (known after apply)
  ~ externaldns_sp_password = (sensitive value)
```
</details>

:memo: Plan generated in [Terraform PRs for Azure #26](https://github.com/acm-uic/IaC/actions/runs/5441669381)